package Lesson9.Lesson9;

public class Lesson9 {
    /*
    Типы переменных и их пределы видимости.
    В зависимости от пределов видимости есть 4 типа переменных:
    1. Локальные, кторые созданы внутри метода. Их область видимости эо блок кода в методе. У них нет дефолтного значения.
    2. Параметр, область видимости которого почти созвапает с локальной переменнтой, это все тело метода.
    3. Интенс переменная или переменная обьекта.
    4. Статические переменные, которые принадлежат всему классу.

     !!!Ключевое слово this указывает на текущий обьект класса
     Его нельзя при обращении к переменным и методам внутри статик метода или при присвоении значения статик переменной.
     Не является ошибочным обратиться с помощью this к статик элементам.

     Garbage collector.
     1. Мы можем определить какие обьекты будут пригодны для того, чтобы чистельщик собрал их (удалил из памяти).
     2. Мы не можем быть наверняка уверены в том, что в определенное время чистельщик удалит обьекты из памяти.
     3. Мы не можем контролировать чистельщик и управлять им.
     4. Управление чистельщиком лежит на JVM.
     */
}
