package Lesson4;

public class Lesson4 {
    public static void main (String[] args) {
/* Классы и объекты
 Структура Java класса:
        1. Заявление пакета
        2. Заявление импорта
        3. Сам класс или несколько классов
            3.1. Переменные (состояние класса)
            3.2. Методы класса (поведение и действия)
            3.3. Конструкторы (позволяет создавать объект класса)

 !!! В Java файле должен быть только 1 public class с именем идентичным имени файла!!!
  Или не быть его вообще, но в файле должен быть 1 класс с именем как у файла.

  Класс выполняемый только тогда, когда в нем есть метод main.
  Переменные могут быть не только внутри метода main, но разница есть.


Создание объекта в файле Test4.

  */

    }
}
