package Lesson4;

public class Lesson4 {
    public static void main (String[] args) {
/* Классы и объекты
 Структура Java класса:
        1. Заявление пакета
        2. Заявление импорта
        3. Сам класс или несколько классов
            3.1. Переменные (состояние класса)
            3.2. Методы класса (поведение и действия)
            3.3. Конструкторы (позволяет создавать объект класса)

 !!! В Java файле должен быть только 1 public class с именем идентичным имени файла!!!
  Или не быть его вообще, но в файле должен быть 1 класс с именем как у файла.

  Класс выполняемый только тогда, когда в нем есть метод main.
  Переменные могут быть не только внутри метода main, но разница есть.


Создание объекта в файле BankAccount.

Дефолтные значения типов данных (выводится если значение не задано):
byte, short, int, long = 0
float, double = 0.0
char = '\u0000' или 0
boolean = false
Все ссылочные типы данных = null (ничто)

Ссылочные типы данных несут в себе адрес области памяти на какой-либо обьект.
Приводится пример собаки (обьект) и поводка (ссылочная переменная).
!!! 1 поводок держит только 1 собаку, но 1 собаку можно держать несколькими поводками !!!
Т.е. ссылочная переменная может содержать адрес только на 1 обьект (не на несколько!), к одному обьекту могут ссыласться
несколько ссылочных переменных.

  */
    }
}
